
{
  "recipedata": [
  {
    "id": 100000001,
    "chef": "User",
    "name": "Creamy Grilled-Corn Pizza",
    "thumbnail": "/images/100000001.png",
    "image": "/images/100000001.png",
    "description": "Easy enough for a weeknight, these grilled pizzas start with store-bought naan or other pre-baked flatbread. The toppings are inspired by Mexican street corn; a blend of sour cream, mayonnaise, lime, and garlic lends tangy creaminess, while charred corn kernels provide juicy sweetness, and we add add in mozzarella for creamy heft. Slice a few as an appetizer, or serve individual pies as a main.",
    "ingredients": [ "Vegetable Oil", "Sour Cream", "Mayonnaise", "Minced", "Garlic", "Lime", "Kosher", "Salt", "Parmigiano-Reggiano", "Thyme", "Leaves", "Sugar", "Paprika", "Corn", "Red", "Onion", "Poblano", "Pepper", "Mozzarella", "Naan", "Peppadew", "Peppers" ],
    "instructions": "Step 1: Preheat grill to medium-high; scrub grates, then lightly brush with oil. In a small bowl, stir together sour cream, mayonnaise, garlic, and lime zest and juice; season with salt and pepper. In another small bowl, stir together Parmigiano, thyme, sugar, and paprika. Step 2: Brush corn, onion, and poblano with oil. Grill corn and poblano, turning occasionally, until lightly charred all over and tender, 12 to 15 minutes total. Transfer poblano to a medium bowl and cover with a plate to steam (this aids in the peeling process). Grill onion, flipping halfway through, until charred but still crisp-tender, about 2 minutes a side. Let everything stand until just cool enough to handle, about 10 minutes. Peel, seed, stem, and dice poblano, and remove kernels from corncobs. Transfer both to a medium bowl; add mozzarella and onion (you should have about 5 cups). Season with salt and pepper. Step 3: Grill one side of flatbreads until golden and lightly charred, about 2 minutes. Remove from grill. Spread about 2 tablespoons sour cream sauce on grilled side of each flatbread, then divide corn mixture among flatbreads. Return to grill, toppings-sides up, and cook until golden on bottoms and mozzarella is melted, checking occasionally and rotating on grates if burning in spots, 2 to 3 minutes. Serve, sprinkled with Parmigiano mixture and sliced Peppadews.",
    "allergens": [ "Gluten", "Dairy" ],
    "utensils": [ "Tablespoon", "Teaspoon", "Bowl", "Grill" ],
    "cookTime": [ 0, 55 ],
    "prepTime": [ 0, 10 ],
    "serves": 6,
    "rating": "80%",
    "favorites": 3
  },
  {
    "id": 100000002,
    "chef": "User",
    "name": "Pull-Apart Sliders",
    "thumbnail": "/images/100000002.jpg",
    "image": "/images/100000002.jpg",
    "description": "An easy recipe to double for a larger crowd, these ground beef sliders require no flipping over a hot grill, no utensils, and very little time prepare. Just broil them in the oven for an all-American cookout even on a rainy summer's day.",
    "ingredients": [ "Ground", "Beef", "Kosher", "Salt", "Hawaiian", "Sweet", "Rolls", "American", "Cheese", "Unsalted", "Butter", "Sesame", "Seeds", "Iceburg", "Lettuce", "Cherry", "Tomatoes", "Cornichons" ],
    "instructions": "Step 1: Preheat broiler with a rack in upper third. Divide beef into twelve 3-inch round patties; place on a rimmed baking sheet and season with salt and pepper. Broil until browned, about 8 minutes. Transfer to paper towels. Step 2: Switch oven to 350°F. Using a serrated knife, split rolls in half horizontally. Place bottom half on a parchment-lined rimmed baking sheet. Layer with half of cheese; top each roll with a burger patty. Layer with remaining cheese; place other half of rolls on top. Brush rolls with melted butter and sprinkle with sesame seeds. Bake until cheese is melted and rolls are lightly toasted but still soft, 8 to 10 minutes. Using toothpicks, skewer each slider with a small piece of lettuce and tomato and cornichon slices on top; serve.",
    "allergens": [ "Dairy", "Gluten" ],
    "utensils": [ "Rimmed", "Baking", "Sheet", "Serrated", "Knife", "Toothpicks" ],
    "cookTime": [ 0, 10 ],
    "prepTime": [ 0, 15 ],
    "serves": 12,
    "rating": "50%",
    "favorites": 0
  },
  {
    "id": 100000003,
    "chef": "User",
    "name": "Chicken Soup",
    "thumbnail": "/images/000000002.jpg",
    "image": "/images/000000002.jpg",
    "description": "Chicken soup is the ultimate comfort food. It warms and satisfies, which is why you make it when you're feeling under the weather or chilled to the bone in winter. Our simple recipe has classic flavors and a short ingredient list and it comes together faster than most versions (you'll have your spoon in a piping hot bowl in just over an hour). It's low-effort, too: All you have to do as the flavors meld together on the stovetop is give your soup the occasional stir.",
    "ingredients": [ "Chicken", "Coarse", "Salt", "Onion", "Celery", "Garlic", "Cloves", "Carrots" ],
    "instructions": "Step 1: Bring chicken, water, and 1 tablespoon salt to a boil in a large stockpot. Skim foam. Add onions, celery, and garlic. Reduce heat. Simmer, partially covered, for 30 minutes. Step 2: Remove breast, and set aside. Add carrots. Simmer, partially covered, for 40 minutes. Step 3: Remove remaining chicken; discard back and wings. Let cool slightly. Remove meat from bones, and cut into bite-size pieces. Step 4: Stir in desired amount of chicken; reserve the rest for another use. Skim fat. Season with salt.",
    "allergens": [],
    "utensils": [ "Tablespoon", "Stockpot" ],
    "cookTime": [ 1, 10 ],
    "prepTime": [ 0, 5 ],
    "serves": 6,
    "rating": "100%",
    "favorites": 5
  },
  {
    "id": 100000004,
    "chef": "User2",
    "name": "Potato Croquettes",
    "thumbnail": "/images/000000002.jpg",
    "image": "/images/000000002.jpg",
    "description": "It's worth setting aside some mashed potatoes just to make these potato croquettes the next day. This finger food is a crowd pleaser and makes an ideal hors d'oeuvres for entertaining or a fun side dish. All it takes is dressing up mashed potatoes with some chopped parsley before shaping the mixture into logs and then breading and frying to golden perfection. Sprinkle with finely chopped parsley before serving and maybe even a dusting of grated parmesan or manchego cheese for a special touch.",
    "ingredients": [ "Mashed", "Potatoes", "Parsley", "Coarse", "Salt", "All-Purpose", "Flour", "Egg", "Breadcrumbs", "Vegetable", "Oil" ],
    "instructions": "Step 1: In a large bowl, stir together mashed potatoes and parsley; season with salt and pepper. In a shallow bowl, place flour; season with salt and pepper. In another shallow bowl, whisk egg with 1 tablespoon water. In a third shallow bowl, place 1 1/2 cups breadcrumbs. Step 2: Form potato mixture into 3/4-by-2-inch logs. Roll in flour, shaking off excess, dip in egg wash, then roll in breadcrumbs to coat. In a heavy medium saucepan, heat 1 1/2 inches vegetable oil over medium-high until hot. In batches, fry croquettes until golden brown on all sides, about 2 minutes per batch, turing as needed. Drain on paper towels.",
    "allergens": [ "Gluten" ],
    "utensils": [ "Large", "Bowl", "Shallow", "Bowl", "Saucepan" ],
    "cookTime": [ 0, 20 ],
    "prepTime": [ 0, 20 ],
    "serves": 6,
    "rating": "66%",
    "favorites": 2
  },
  {
    "id": 100000005,
    "chef": "User2",
    "name": "Basic Empanadas",
    "thumbnail": "/images/000000002.jpg",
    "image": "/images/000000002.jpg",
    "description": "These tasty and convenient Latin-American-style turnovers can be frozen for up to three months, individually wrapped in plastic and placed in resealable plastic bags. There's no need to thaw before baking, they can go right from the freezer to the oven.",
    "ingredients": [ "Ground", "Beef", "Onion", "Jalapeno", "Chiles", "Chili", "Powder", "Canned", "Diced", "Tomatoes", "Coarse", "Salt", "Cilantro", "All-Purpose", "Flour", "Baking", "Powder", "Stick", "Butter", "Egg" ],
    "instructions": "Step 1: Make the filling: In a 12-inch skillet over medium-high, cook meat until no longer pink, breaking it up into small pieces, 5 to 7 minutes. Step 2: Add onion and jalapenos; cook until soft, 5 minutes. Stir in chili powder and tomatoes. Cook over medium until mixture has thickened, 12 to 15 minutes. Season with salt and pepper. Fold in cilantro. Let cool. Step 3: Make the dough: In a bowl, combine flour, baking powder, and salt. Using your fingers, cut in butter until mixture is crumbly. Add just enough cold water so dough comes together. Step 4: Form empanadas. If desired, freeze on a baking sheet until firm, 2 hours. Wrap tightly in plastic; freeze in plastic bags. Step 5: To bake fresh or frozen empanadas, preheat oven to 400 degrees. Place on parchment-lined baking sheets. Brush tops with egg wash, avoiding crimped edges. Bake until golden brown, rotating sheets halfway through, 30 to 40 minutes.",
    "allergens": [ "Dairy" ],
    "utensils": [ "Teaspoon", "12-inch", "Skillet", "Bowl", "Baking", "Sheet" ],
    "cookTime": [ 2, 0 ],
    "prepTime": [ 1, 0 ],
    "serves": 8,
    "rating": "60%",
    "favorites": 1
  },
  {
    "id": 100000006,
    "chef": "User2",
    "name": "Queso Fundido",
    "thumbnail": "/images/000000002.jpg",
    "image": "/images/000000002.jpg",
    "description": "Dig into this vegetarian version of the classic party starter straight from the oven -- the double-cheese, double-chile dip is bubbling and delicious after only 10 minutes.",
    "ingredients": [ "Extra-Virgin", "Olive", "Oil", "Poblano", "Chile", "Onion", "Kosher", "Salt", "Serrano", "Chile", "Mozzarella", "Goat", "Cheese", "Jicama", "Sticks", "Radish", "Tortilla", "Chips" ],
    "instructions": "Step 1: Preheat broiler with rack 4 inches from heating element. Heat a large ovenproof skillet over medium-high. Swirl in oil. Add poblano and cook, 3 minutes. Add onion and season with salt. Cook until onion is softened and poblano is slightly charred, 4 minutes. Add serrano and cook until softened, 2 minutes more. Remove from heat. Add both cheeses. Broil until bubbly and browned in spots, 2 to 3 minutes. Serve with jicama sticks, radishes, and tortilla chips.",
    "allergens": [ "Dairy" ],
    "utensils": [ "Ovenproof", "Skillet" ],
    "cookTime": [ 0, 5 ],
    "prepTime": [ 0, 25 ],
    "serves": 6,
    "rating": "73%",
    "favorites": 2
    }
  ]
}